DataProcessors/ИА_РабочийСтолСтатистик_Упр_HTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИА_РабочийСтолСтатистик_Упр_HTML</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ИА_НастройкиРасшифровкиСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НастройкиРасшифровкиСтатистик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИА_ПоляРасшифровки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ПоляРасшифровки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аналитика1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аналитика2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аналитика3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вопрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВариантыПолученияДанныхСтатистик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыПолученияДанныхСтатистик</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомСтатистика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзЗапроса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конструктором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формула</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИА_Статистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_Статистика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_УчетСтатистик</xr:Item>
				<xr:Item>AccumulationRegister.ИА_УчетВопросовСтатистик</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтатистики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика1</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаПредставление3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВведения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданаВМобильномПриложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВопросыПроверочногоСписка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВопросыПроверочногоСписка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Балл</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВопросТекст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПакетСтатистик</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ИА_РабочийСтолСтатистик_Упр_HTML/Forms/ФормаРасшифровки/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОбновитьОтчет(Команда)
	Если ВладелецФормы<>Неопределено Тогда
		СоответствиеМассиваГруппировок = Новый Соответствие;
		Для Каждого СтрокаТаблицы Из ТаблицаГруппировкиПолей Цикл
			СоответствиеМассиваГруппировок.Вставить(СтрокаТаблицы.ВидСтатистики, СтрокаТаблицы.ПоляРасшифровкиВыбраны.ВыгрузитьЗначения());
		КонецЦикла;
		ВладелецФормы.ВывестиОтчет_расшифровку(НомерСтатистики, СоответствиеМассиваГруппировок);
		ОбновитьОтчетСервер(ВладелецФормы.ТабДокРасшифровка);
	КонецЕсли;
КонецПроцедуры 

&наСервере
Процедура ОбновитьОтчетСервер(табдок_род)
	ТабДок.Очистить();
	ТабДок.Вывести(табдок_род);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииНаСервере()
	
	СоответствиеНастроек = ПолучитьНастройкиПользователя();
	ОднаГруппировка = СписокВидовСтатистики.Количество() = 1;
	Для Каждого СтрВидСтатистики Из СписокВидовСтатистики Цикл
		ВидСтатистики = СтрВидСтатистики.Значение;
		НовСтрГруппировки = ТаблицаГруппировкиПолей.Добавить();
		НовСтрГруппировки.ВидСтатистики = ВидСтатистики;
		Если ОднаГруппировка Тогда 
			НовСтрГруппировки.ЗаголовокГруппировкиПолей = "Группировка полей";
		Иначе
			НовСтрГруппировки.ЗаголовокГруппировкиПолей = "Группировка полей: " + ВидСтатистики;
		КонецЕсли;
			
		СтруктураНастроек = СоответствиеНастроек.Получить(ВидСтатистики);
		
		Если СтруктураНастроек = Неопределено Тогда
			//Восстановим по умолчанию для вида статистики
			ЗагрузитьАналитики(ВидСтатистики);
		Иначе
			//Берем сохраненные пользователем настройки
			
			Для Каждого Эл Из СтруктураНастроек.ПоляРасшифровкиВсе Цикл
				НовЭл = НовСтрГруппировки.ПоляРасшифровкиВсе.Добавить();
				ЗаполнитьЗначенияСвойств(НовЭл,Эл);
			КонецЦикла;
						
			Для Каждого Эл Из СтруктураНастроек.ПоляРасшифровкиВыбраны Цикл
				НовЭл = НовСтрГруппировки.ПоляРасшифровкиВыбраны.Добавить();
				ЗаполнитьЗначенияСвойств(НовЭл,Эл);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ТаблицаГруппировкиПолей.ВысотаВСтрокахТаблицы = ТаблицаГруппировкиПолей.Количество();
	
	ОбновитьОтчет(Неопределено);

КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиПользователя()
	
	СоответствиеНастроек = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_НастройкиПользователей.Настройка,
	|	ИА_НастройкиПользователей.ВидСтатистики
	|ИЗ
	|	РегистрСведений.ИА_НастройкиРасшифровкиСтатистик КАК ИА_НастройкиПользователей
	|ГДЕ
	|	ИА_НастройкиПользователей.Пользователь = &Пользователь
	|	И ИА_НастройкиПользователей.ВидСтатистики В(&МассивВидовСтатистики)";
	
	Запрос.УстановитьПараметр("МассивВидовСтатистики", СписокВидовСтатистики.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СоответствиеНастроек.Вставить(ВыборкаДетальныеЗаписи.ВидСтатистики, ВыборкаДетальныеЗаписи.Настройка.Получить());
	КонецЦикла;
	Возврат СоответствиеНастроек;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьАналитики(Статистика)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидСтатистики", Статистика);
	МассивСтрок = ТаблицаГруппировкиПолей.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ЭлМассива Из МассивСтрок Цикл
		ПоляРасшифровкиВсе		= ЭлМассива.ПоляРасшифровкиВсе;
		ПоляРасшифровкиВыбраны	= ЭлМассива.ПоляРасшифровкиВыбраны;
		
		ПоляРасшифровкиВсе.Очистить();
		ПоляРасшифровкиВыбраны.Очистить();
		ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Период,"Период");
		ПоляРасшифровкиВыбраны.Добавить(Перечисления.ИА_ПоляРасшифровки.Период,"Период");
		Если ЗначениеЗаполнено(Статистика.Аналитика1) тогда
			ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика1, Статистика.Аналитика1.Наименование);
			ПоляРасшифровкиВыбраны.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика1, Статистика.Аналитика1.Наименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(Статистика.Аналитика2) тогда
			ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика2, Статистика.Аналитика2.Наименование);
			ПоляРасшифровкиВыбраны.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика2, Статистика.Аналитика2.Наименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(Статистика.Аналитика3) тогда
			ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика3, Статистика.Аналитика3.Наименование);
			ПоляРасшифровкиВыбраны.Добавить(Перечисления.ИА_ПоляРасшифровки.Аналитика3, Статистика.Аналитика3.Наименование);
		КонецЕсли;
		
		Если Статистика.ВариантПолученияДанных =ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика") 
			И ЗначениеЗаполнено(Статистика.ПроверочныйСписок) Тогда
			
			ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Вопрос, "Вопрос");
			ПоляРасшифровкиВыбраны.Добавить(Перечисления.ИА_ПоляРасшифровки.Вопрос, "Вопрос");
			
			ПоляРасшифровкиВсе.Добавить(Перечисления.ИА_ПоляРасшифровки.Ответ, "Ответ");
			
		КонецЕсли;;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПоляРасшифровкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ф = ПолучитьФорму("Обработка.ИА_РабочийСтолСтатистик_Упр_HTML.Форма.ФормаНастройкиГруппировки");
	
	Статистика = ТекущийЭлемент.ТекущиеДанные.ВидСтатистики;
	ПоляРасшифровкиВыбраны = ТекущийЭлемент.ТекущиеДанные.ПоляРасшифровкиВыбраны;
	ПоляРасшифровкиВсе = ТекущийЭлемент.ТекущиеДанные.ПоляРасшифровкиВсе;
	
	ф.Статистика = Статистика;
	
	Для каждого стр из ПоляРасшифровкиВыбраны Цикл
		Новстр = ф.ПоляРасшифровкиВыбраны.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр, стр);
	КонецЦикла;	
	
	Для каждого стр из ПоляРасшифровкиВсе Цикл
		ф.Элементы.ПоляРасшифровкиВыбраныПредставление.СписокВыбора.Добавить(стр.Представление);
	КонецЦикла;
	
	рез = ф.ОткрытьМодально();
	Если рез = КодВозвратаДиалога.ОК Тогда
		ПоляРасшифровкиВыбраны.Очистить();
		Для каждого стр из ф.ПоляРасшифровкиВыбраны Цикл
			Если стр.Представление = "" Тогда
				Продолжить;
			КонецЕсли;
			Для каждого СтрПоле из ПоляРасшифровкиВсе Цикл
				Если СтрПоле.Представление = стр.Представление Тогда
					ТекЗнач = СтрПоле.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			ПоляРасшифровкиВыбраны.Добавить(ТекЗнач, стр.Представление);
		КонецЦикла;
		ОбновитьОтчет(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ПередЗакрытиемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗакрытиемНаСервере()
		
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	НаборЗаписей = РегистрыСведений.ИА_НастройкиРасшифровкиСтатистик.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Прочитать();
	ТаблицаНабора = НаборЗаписей.Выгрузить();
	
	ПараметрыОтбора = Новый Структура;
	
	Для Каждого Стр Из ТаблицаГруппировкиПолей Цикл
		ПараметрыОтбора.Вставить("ВидСтатистики", Стр.ВидСтатистики);
		НайденныеСтроки = ТаблицаНабора.НайтиСтроки(ПараметрыОтбора);	
		
		Если НайденныеСтроки.Количество() = 0 Тогда 
			СтрокаНабора = ТаблицаНабора.Добавить();
			СтрокаНабора.Пользователь = Пользователь;
			СтрокаНабора.ВидСтатистики = Стр.ВидСтатистики;
		Иначе
			СтрокаНабора = НайденныеСтроки[0];
		КонецЕсли;
		
		СтрокаНабора.Настройка = Новый ХранилищеЗначения(ВернутьСохраняемуюСтруктуруНастроек(Стр));
		
	КонецЦикла;
	НаборЗаписей.Загрузить(ТаблицаНабора);
	НаборЗаписей.Записать();

КонецПроцедуры

&НаСервере
Функция ВернутьСохраняемуюСтруктуруНастроек(Стр)
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ПоляРасшифровкиВсе",Стр.ПоляРасшифровкиВсе);
	СтруктураНастроек.Вставить("ПоляРасшифровкиВыбраны",Стр.ПоляРасшифровкиВыбраны);
	Возврат СтруктураНастроек;
КонецФункции

&НаСервере
Процедура ВосстановитьГруппировкуПоУмолчаниюНаСервере()
	Для Каждого ВидСтатистики Из СписокВидовСтатистики Цикл
		ЗагрузитьАналитики(ВидСтатистики.Значение);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьГруппировкуПоУмолчанию(Команда)
	ВосстановитьГруппировкуПоУмолчаниюНаСервере();
	ОбновитьОтчет(Неопределено);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеВидаСтат(ВидСтат)
	Рез = Новый Структура("ЗапросОтображаетСостояние,ВариантПолученияДанных,Ссылка,ПроверочныйСписок");
	ЗаполнитьЗначенияСвойств(Рез, ВидСтат);
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Если Расшифровка.Свойство("ВидСтатистики") Тогда
			
			СтандартнаяОбработка = Ложь;
			ВидСтатистикиСтрукт = ПолучитьДанныеВидаСтат(Расшифровка.ВидСтатистики);
			ЗапросОтображаетСостояние = ВидСтатистикиСтрукт.ЗапросОтображаетСостояние;
			
			ПроверочныйСписок = ВидСтатистикиСтрукт.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика") И ЗначениеЗаполнено(ВидСтатистикиСтрукт.ПроверочныйСписок);
			Если ВидСтатистикиСтрукт.ВариантПолученияДанных = ПредопределенноеЗначение("Перечисление.ИА_ВариантыПолученияДанныхСтатистик.ДокументомСтатистика") Тогда
				
				МассивРегистраторов = ПолучитьСписокРегистраторов(Расшифровка, ПроверочныйСписок, ЗапросОтображаетСостояние);
				КоличествоРегистраторов = МассивРегистраторов.Количество();
				
				Если КоличествоРегистраторов = 0 Тогда
				ИначеЕсли КоличествоРегистраторов = 1 тогда
					ПоказатьЗначение(, МассивРегистраторов[0]);
				Иначе
					ФормаСписка = ПолучитьФорму("Документ.ИА_Статистика.ФормаСписка",Новый Структура("СброситьПериод", Истина),ЭтаФорма,Новый УникальныйИдентификатор);
					ИА_КСУОбщийКлиентСервер.ДобавитьЭлементОтбора(ФормаСписка.Список.Отбор.Элементы, "Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, МассивРегистраторов, Истина);
					ФормаСписка.Открыть();
				КонецЕсли;
			КонецЕсли;					
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция  ПолучитьСписокРегистраторов(СтруктураРасшифровки, ПроверочныйСписок, ЗапросОтображаетСостояние)
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ИА_Статистика.Ссылка
	               |ИЗ
	               |	Документ.ИА_Статистика.ВопросыПроверочногоСписка КАК ИА_Статистика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИА_Статистика.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_Статистика.Ссылка.Дата УБЫВ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	
	Оператор = ПакетЗапросов.Операторы[0];
	
	Если Не ПроверочныйСписок Тогда
		Оператор.Источники.Заменить(0, ПакетЗапросов.ДоступныеТаблицы.Найти("Документы").Состав.Найти("Документ.ИА_Статистика"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Для каждого ПолеРасшифровки Из СтруктураРасшифровки Цикл
		
		Если ПолеРасшифровки.Значение = null Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПолеРасшифровки.Ключ = "Период" Тогда
			
			Оператор.Отбор.Добавить("ИА_Статистика.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания");
			
			Запрос.УстановитьПараметр("ДатаНачала", СтруктураРасшифровки.Период.ДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", СтруктураРасшифровки.Период.ДатаОкончания);
			
		ИначеЕсли ПолеРасшифровки.Ключ = "Вопрос" Или ПолеРасшифровки.Ключ = "Ответ" Тогда
			
			Если ПроверочныйСписок Тогда
				Оператор.Отбор.Добавить("ИА_Статистика."+ПолеРасшифровки.Ключ+" = &"+ПолеРасшифровки.Ключ+"");
				Запрос.УстановитьПараметр(ПолеРасшифровки.Ключ, ПолеРасшифровки.Значение);
			КонецЕсли;
			
		Иначе
			
			Оператор.Отбор.Добавить("ИА_Статистика.Ссылка."+ПолеРасшифровки.Ключ+" = &"+ПолеРасшифровки.Ключ+"");
			
			Запрос.УстановитьПараметр(ПолеРасшифровки.Ключ, ПолеРасшифровки.Значение);
			
		КонецЕсли;

	КонецЦикла;
	
	ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	МассивРегистраторов =  Новый Массив;
	
	Если ЗапросОтображаетСостояние Тогда
		Если Выборка.Следующий() Тогда
			КрайнийПериод = Выборка.Ссылка.Дата;
		иначе
			Возврат МассивРегистраторов;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ДатаНачала", КрайнийПериод);
		Запрос.УстановитьПараметр("ДатаОкончания", КрайнийПериод);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
	
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		МассивРегистраторов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивРегистраторов;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
КонецПроцедуры
